In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
data=['王伟超','王小超','王大超','王年轻超']
pd.DataFrame(data,columns=['name'],index=['a','b','c','d'])

   name
a   王伟超
b   王小超
c   王大超
d  王年轻超

In [5]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
pd.DataFrame(data,columns=['Name','Age'])

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [6]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [7]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)

In [8]:
data = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
        'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
pd.DataFrame(data)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [9]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data, index=['s1','s2','s3','s4'])

In [10]:
df

     Name  Age
s1    Tom   28
s2   Jack   34
s3  Steve   29
s4  Ricky   42

In [11]:
df.axes

[Index(['s1', 's2', 's3', 's4'], dtype='object'),
 Index(['Name', 'Age'], dtype='object')]

In [12]:
df.head(2)

    Name  Age
s1   Tom   28
s2  Jack   34

In [13]:
df.tail(3)

     Name  Age
s2   Jack   34
s3  Steve   29
s4  Ricky   42

In [14]:
df.index

Index(['s1', 's2', 's3', 's4'], dtype='object')

In [15]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [48]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
     'three' : pd.Series([1, 3, 4], index=['a', 'c', 'd'])}

df = pd.DataFrame(d)

In [17]:
df

   one  two  three
a  1.0    1    1.0
b  2.0    2    NaN
c  3.0    3    3.0
d  NaN    4    4.0

In [18]:
df[['one','two']]

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [49]:
df['four']=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [20]:
df

   one  two  three  four
a  1.0    1    1.0     1
b  2.0    2    NaN     2
c  3.0    3    3.0     3
d  NaN    4    4.0     4

In [21]:
df['four']=pd.Series([1,2,3,4])

In [22]:
df

   one  two  three  four
a  1.0    1    1.0   NaN
b  2.0    2    NaN   NaN
c  3.0    3    3.0   NaN
d  NaN    4    4.0   NaN

In [23]:
df['four']=[1,2,3,4]

In [24]:
df

   one  two  three  four
a  1.0    1    1.0     1
b  2.0    2    NaN     2
c  3.0    3    3.0     3
d  NaN    4    4.0     4

In [25]:
df['four']=pd.Series([1,2,3],index=['b','c','d'])

In [26]:
df

   one  two  three  four
a  1.0    1    1.0   NaN
b  2.0    2    NaN   1.0
c  3.0    3    3.0   2.0
d  NaN    4    4.0   3.0

In [27]:
del(df['four'])

In [28]:
df

   one  two  three
a  1.0    1    1.0
b  2.0    2    NaN
c  3.0    3    3.0
d  NaN    4    4.0

In [30]:
df

   one  two  three
a  1.0    1    1.0
b  2.0    2    NaN
c  3.0    3    3.0
d  NaN    4    4.0

In [31]:
df = pd.DataFrame([['zs', 12], ['ls', 4]], columns = ['Name','Age'])

In [32]:
df

  Name  Age
0   zs   12
1   ls    4

In [33]:
df2 = pd.DataFrame([['ww', 16], ['zl', 8]], columns = ['Name','Age'])

In [34]:
df2

  Name  Age
0   ww   16
1   zl    8

In [38]:
df=df.append(df2)

In [39]:
df

  Name  Age
0   zs   12
1   ls    4
0   ww   16
1   zl    8

In [44]:
df.index=np.arange(4)

In [45]:
df

  Name  Age
0   zs   12
1   ls    4
2   ww   16
3   zl    8

In [47]:
df.append(pd.Series(['hh',10],name=4,index=['Name','Age']))

  Name  Age
0   zs   12
1   ls    4
2   ww   16
3   zl    8
4   hh   10

In [50]:
df

   one  two  three  four
a  1.0    1    1.0     1
b  2.0    2    NaN     2
c  3.0    3    3.0     3
d  NaN    4    4.0     4

In [54]:
df.loc['b']['one']

2.0

In [55]:
df['one']['b']

2.0

In [56]:
df.loc['b','one']

2.0

In [58]:
df.loc['b']

one      2.0
two      2.0
three    NaN
four     2.0
Name: b, dtype: float64

In [60]:
df.loc['b':'b'].loc['b','one']

2.0